















































































































































































































# Familiarization with Python Pandas library

### 1) Use Python lists and dictionaries. How to do slicing of lists using the colon (:) specifications.

#### Python List

-> List is one of the Sequence Data structure

-> Lists are collection of items (Strings, integers or even other lists)

-> Lists are enclosed in [ ]

-> Each item in the list has an assigned index value.

-> Each item in a list is separated by a comma

-> Lists are mutable, which means they can be changed.

In [ ]:
# Creation 
empty_List = []
lst = [1,2,3,4,5] # List of numbers
lst1 = [[1,2,3],[3,4,5]] # List of Lists
lst2 = [1,'a',2,'b'] #List of different data type

print(empty_List, lst, lst1, lst2, sep='\n')

[]
[1, 2, 3, 4, 5]
[[1, 2, 3], [3, 4, 5]]
[1, 'a', 2, 'b']

In [ ]:
# Append
lst = [1,2,3]
lst.append(4) # Append will add item at the end
print(lst)

[1, 2, 3, 4]

In [ ]:
# Insert
lst.insert(2,'Two') # Will add element 'Two' at location index 2
print(lst)

[1, 2, 'Two', 3, 4]

In [ ]:
# Remove
lst.remove('Two') # Remove first occurence of 'Two'
print(lst)

[1, 2, 3, 4]

In [ ]:
# List Slicing
# Accessing parts of segments is called slicing.

lst = [0,1,2,3,4,5,6,7,8,9]

print(lst[:]) #Print all Elements

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [ ]:
#Print Alternae Elements
print(lst[ : :2])

[0, 2, 4, 6, 8]

In [ ]:
#Print Element from index 1(Included) to 3(Excluded)
print(lst[1:3])

[1, 2]

In [ ]:
#Reversing Element of list
print(lst[::-1])

[9, 8, 7, 6, 5, 4, 3, 2, 1, 0]

#### Python Dictionary

Python dictionary is an unordered collection of items. While other compound data types have only value as an element, a dictionary has a pair.

In [ ]:
# Creation

#Creating Empty Dictionary
Empty_dict = {}

#dictionary with integer keys
my_dict1 = {1: 'abc', 2: 'xyz'}

#dictionary with mixed keys
my_dict2 = {'name': 'Anurag', 1: ['abc', 'xyz']}

#create empty dictionary using dict()
my_dict3 = dict()

#create a dict with list of tuples
my_dict4 = dict([(1, 'abc'), (2, 'xyz')])    

print(Empty_dict, my_dict1, my_dict2, my_dict3, my_dict3, sep='\n')

{}
{1: 'abc', 2: 'xyz'}
{'name': 'Anurag', 1: ['abc', 'xyz']}
{}
{}

In [ ]:
# Access

my_dict = {'Name': 'Anurag', 'Age': 23, 'Address': 'KOTA'}

#get attributes
print("Name is :",my_dict['Name'])
print("Age is :",my_dict['Age'])
print("Address is :",my_dict.get('Address')) #Another way of accessing Dictionary

Name is : Anurag
Age is : 23
Address is : KOTA

In [ ]:
# Add and Modify

# Update Key
my_dict['Name'] = 'Saraswat'

# Add New Key-Value Pair
my_dict['Degree'] = 'M.Tech'

print(my_dict)

{'Name': 'Saraswat', 'Age': 23, 'Address': 'KOTA', 'Degree': 'M.Tech'}

In [ ]:
# Remove Element

# remove a particular item
print(my_dict.pop('Age'))

del my_dict['Address']

# remove an arbitarty key
print(my_dict.popitem())

print(my_dict)

23
('Degree', 'M.Tech')
{'Name': 'Saraswat'}

### 2) Create a DataFrame object from the data loaded from a dataset. 

### 3) Print various rows and columns of the dataset. 

### 4) Print a subset of rows and a subset of columns

In [ ]:
# Import Pandas
import pandas as pd

In [ ]:
# Reading Data from sample csv file provided in colab by default
# california_housing Data set

my_data = pd.read_csv('./sample_data/california_housing_test.csv')

my_data.head() #By Default Print Data of first five rows

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [ ]:
my_data.columns #Displays Columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [ ]:
# Accessing Data of particular row
my_data.iloc[3] #Returning data of 3rd row

longitude               -118.3600
latitude                  33.8200
housing_median_age        28.0000
total_rooms               67.0000
total_bedrooms            15.0000
population                49.0000
households                11.0000
median_income              6.1359
median_house_value    330000.0000
Name: 3, dtype: float64

In [ ]:
# Accessing data of particular row and column
my_data.iloc[3,1] #Print data of first 3 row and first column

33.82

In [ ]:
my_data.iloc[3,[1,2,3]] #Print data of first row and 1,2,3 column

latitude              33.82
housing_median_age    28.00
total_rooms           67.00
Name: 3, dtype: float64

In [ ]:
# Slicing

my_data.iloc[:5,[1,2,3]] #Return data of first five row and first three column

   latitude  housing_median_age  total_rooms
0     37.37                27.0       3885.0
1     34.26                43.0       1510.0
2     33.78                27.0       3589.0
3     33.82                28.0         67.0
4     36.33                19.0       1241.0

In [ ]:
# Creating new data frame from existing data frame
# Only data of longitude and latitude is present in new data frame
new_df = pd.DataFrame(my_data,columns=['longitude','latitude'])  
new_df.head()

   longitude  latitude
0    -122.05     37.37
1    -118.30     34.26
2    -117.81     33.78
3    -118.36     33.82
4    -119.67     36.33

### 5) How to group (aggregate) specific columns that correspond to certain specific values of rows. (use DataFrame.groupby())

Gouping above data i.e california_housing dataset on the basis of Housing Median Age and creating new data frame as new_df

In [ ]:

new_df = my_data.groupby(['housing_median_age'], as_index=False)

In [ ]:
# Presenting Mean of Columns grouped by housing_median_age
new_df.mean().head()

   housing_median_age   longitude  ...  median_income  median_house_value
0                 1.0 -117.450000  ...       3.250000        98350.000000
1                 2.0 -119.596667  ...       6.189233       217183.333333
2                 3.0 -119.389167  ...       5.143750       238191.666667
3                 4.0 -118.963571  ...       5.036068       220085.714286
4                 5.0 -119.550513  ...       4.613059       202925.692308

[5 rows x 9 columns]

In [ ]:
# Taking mean of total_rooms present in dataframe grouped by housing_median_age
new_df[['total_rooms']].mean().head() #By using double brackets it returns as data frame

   housing_median_age  total_rooms
0                 1.0    44.500000
1                 2.0  9006.333333
2                 3.0  6731.250000
3                 4.0  7383.392857
4                 5.0  5660.615385

In [ ]:
#Presenting various stats of column total_rooms present in dataframe grouped by housing_median_age using aggregate function.
my_stat = ['count','mean','max', 'min', 'sum']
new_df[['total_rooms']].agg(my_stat).head()

                   total_rooms
                         count         mean      max     min       sum
housing_median_age
1.0                          2    44.500000     83.0     6.0      89.0
2.0                          6  9006.333333  30450.0   158.0   54038.0
3.0                         12  6731.250000  13802.0  1206.0   80775.0
4.0                         28  7383.392857  23915.0  1346.0  206735.0
5.0                         39  5660.615385  27870.0   906.0  220764.0

In [ ]:
# Presenting mean of column total_rooms and max of column total_bedrooms present in dataframe grouped by housing_median_age
new_df.agg({'total_rooms': 'mean' , 'total_bedrooms' : 'max' }).head()

   housing_median_age  total_rooms  total_bedrooms
0                 1.0    44.500000            15.0
1                 2.0  9006.333333          5033.0
2                 3.0  6731.250000          2244.0
3                 4.0  7383.392857          4585.0
4                 5.0  5660.615385          5027.0